Results/hbase/load-continuous-vmhb5-kill-1.dat
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.HBaseClient -P /root/ycsb/config/hbase.conf -P /root/ycsb/config/workload-ycsb-thomas -P /root/ycsb/config/workload-ycsb-thomas-load -s -load
 0 sec: 0 operations; 
 10 sec: 19211 operations; 1920.91 current ops/sec; [INSERT AverageLatency(us)=12229] 
 20 sec: 37734 operations; 1851.56 current ops/sec;  
 30 sec: 55113 operations; 1737.73 current ops/sec;  
 40 sec: 72499 operations; 1738.43 current ops/sec;  
 50 sec: 93809 operations; 2130.79 current ops/sec;  
 60 sec: 106767 operations; 1295.67 current ops/sec;  
 70 sec: 122691 operations; 1592.24 current ops/sec;  
 80 sec: 141293 operations; 1860.01 current ops/sec; [INSERT AverageLatency(us)=14226] 
 90 sec: 162499 operations; 2120.39 current ops/sec;  
 100 sec: 179186 operations; 1668.53 current ops/sec; [INSERT AverageLatency(us)=19636] 
 110 sec: 197218 operations; 1803.02 current ops/sec;  
 120 sec: 215177 operations; 1795.72 current ops/sec; [INSERT AverageLatency(us)=14853] 
 130 sec: 235281 operations; 2010.2 current ops/sec; [INSERT AverageLatency(us)=27161.5] 
 140 sec: 254033 operations; 1874.64 current ops/sec;  
 150 sec: 270138 operations; 1610.18 current ops/sec;  
 160 sec: 288202 operations; 1806.22 current ops/sec;  
 166 sec: 300000 operations; 1887.68 current ops/sec;   
[OVERALL], RunTime(ms), 166272.0
[OVERALL], Throughput(ops/sec), 1804.2725173210163
[INSERT], Operations, 300000
[INSERT], AverageLatency(us), 16582.48269
[INSERT], MinLatency(us), 2389
[INSERT], MaxLatency(us), 1417870
[INSERT], Return=0, 299999
[INSERT], 0, 47771.03968816442
[INSERT], 1000, 12168.402424242424
[INSERT], 2000, 12140.042822185971
[INSERT], 3000, 18314.673581452105
[INSERT], 4000, 15300.498976458546
[INSERT], 5000, 13220.249778565101
[INSERT], 6000, 11344.749620060791
[INSERT], 7000, 11522.31261913839
[INSERT], 8000, 12833.728013728014
[INSERT], 9000, 11876.302058590658
[INSERT], 10000, 17354.216027874565
[INSERT], 11000, 18757.631019387118
[INSERT], 12000, 16433.149589041095
[INSERT], 13000, 14885.88057482656
[INSERT], 14000, 13931.399347623486
[INSERT], 15000, 18402.44348894349
[INSERT], 16000, 18544.927070457354
[INSERT], 17000, 17462.924661565627
[INSERT], 18000, 18734.16996291718
[INSERT], 19000, 19001.026819923372
[INSERT], 20000, 18665.874303405573
[INSERT], 21000, 17842.969660916122
[INSERT], 22000, 13534.25820962663
[INSERT], 23000, 13867.5875
[INSERT], 24000, 16614.862756264236
[INSERT], 25000, 20601.624664879357
[INSERT], 26000, 19442.58024691358
[INSERT], 27000, 18076.95673076923
[INSERT], 28000, 16609.183445190156
[INSERT], 29000, 17152.183304144775
[INSERT], 30000, 30023.58519269777
[INSERT], 31000, 18222.540350877192
[INSERT], 32000, 14998.427213606803
[INSERT], 33000, 16716.814134668894
[INSERT], 34000, 15617.960505529227
[INSERT], 35000, 15360.65365111562
[INSERT], 36000, 14990.021827411167
[INSERT], 37000, 19146.025867507888
[INSERT], 38000, 17395.575757575756
[INSERT], 39000, 18619.512345679013
[INSERT], 40000, 17921.17474566128
[INSERT], 41000, 16143.744073275862
[INSERT], 42000, 15485.039731682147
[INSERT], 43000, 13808.703959484346
[INSERT], 44000, 11276.316898757997
[INSERT], 45000, 12382.327280231118
[INSERT], 46000, 11610.847260007773
[INSERT], 47000, 12814.073076923078
[INSERT], 48000, 14885.367844698856
[INSERT], 49000, 18366.344
[INSERT], 50000, 73292.79944674966
[INSERT], 51000, 19044.298101265824
[INSERT], 52000, 15478.868421052632
[INSERT], 53000, 27595.172509225093
[INSERT], 54000, 12895.840155105558
[INSERT], 55000, 10714.152714932126
[INSERT], 56000, 102887.18461538461
[INSERT], 57000, 40976.17911714771
[INSERT], 58000, 19410.193486590037
[INSERT], 59000, 39869.339984038306
[INSERT], 60000, 17545.812016656753
[INSERT], 61000, 20111.323687752356
[INSERT], 62000, 17647.01733102253
[INSERT], 63000, 17048.147597254003
[INSERT], 64000, 18431.132802937576
[INSERT], 65000, 18526.29234629862
[INSERT], 66000, 17035.378847229993
[INSERT], 67000, 17927.990419161677
[INSERT], 68000, 14952.31081081081
[INSERT], 69000, 14360.605425987625
[INSERT], 70000, 11250.831325301206
[INSERT], 71000, 17641.684711481263
[INSERT], 72000, 19022.95423197492
[INSERT], 73000, 16129.217624932831
[INSERT], 74000, 18805.03652392947
[INSERT], 75000, 17241.42906774754
[INSERT], 76000, 16322.605291576674
[INSERT], 77000, 17774.79643916914
[INSERT], 78000, 16902.69926925239
[INSERT], 79000, 16037.375871313672
[INSERT], 80000, 17647.30053034767
[INSERT], 81000, 16852.94400452489
[INSERT], 82000, 15605.912616339194
[INSERT], 83000, 14706.391858754292
[INSERT], 84000, 15526.699069286453
[INSERT], 85000, 11092.650723025585
[INSERT], 86000, 10507.358741258742
[INSERT], 87000, 11440.360474006116
[INSERT], 88000, 17812.760167464116
[INSERT], 89000, 19477.732686084142
[INSERT], 90000, 17369.181395348838
[INSERT], 91000, 16196.190193965518
[INSERT], 92000, 18531.750464396286
[INSERT], 93000, 18096.633955448524
[INSERT], 94000, 18214.009118541035
[INSERT], 95000, 18106.78540772532
[INSERT], 96000, 18775.723010487352
[INSERT], 97000, 18242.183201460743
[INSERT], 98000, 15988.087326943558
[INSERT], 99000, 14751.94071146245
[INSERT], 100000, 20235.66313559322
[INSERT], 101000, 19065.871402327004
[INSERT], 102000, 19067.22601010101
[INSERT], 103000, 15879.487843551797
[INSERT], 104000, 16515.8472145615
[INSERT], 105000, 13698.708771929825
[INSERT], 106000, 21803.4812583668
[INSERT], 107000, 14981.841396508727
[INSERT], 108000, 12956.758531317495
[INSERT], 109000, 11682.1515387612
[INSERT], 110000, 13871.55199628598
[INSERT], 111000, 17825.174123337365
[INSERT], 112000, 17921.437054631828
[INSERT], 113000, 18276.30778515389
[INSERT], 114000, 22816.99239543726
[INSERT], 115000, 18314.979192166462
[INSERT], 116000, 18422.45488029466
[INSERT], 117000, 17453.036713286714
[INSERT], 118000, 17075.003414911782
[INSERT], 119000, 15632.014590932777
[INSERT], 120000, 13340.577333333333
[INSERT], 121000, 13614.885052248977
[INSERT], 122000, 13392.050938337801
[INSERT], 123000, 17762.23568019093
[INSERT], 124000, 15893.111873350923
[INSERT], 125000, 12891.466981132075
[INSERT], 126000, 17923.12822049131
[INSERT], 127000, 16139.226016260163
[INSERT], 128000, 13717.120235934664
[INSERT], 129000, 16503.9625137817
[INSERT], 130000, 16803.169006176304
[INSERT], 131000, 17602.79308323564
[INSERT], 132000, 18028.905946601943
[INSERT], 133000, 14879.890748031496
[INSERT], 134000, 13979.031177291763
[INSERT], 135000, 13492.507879333634
[INSERT], 136000, 17542.799059929494
[INSERT], 137000, 16311.431212615553
[INSERT], 138000, 17679.458775029445
[INSERT], 139000, 19374.977272727272
[INSERT], 140000, 18369.71166768479
[INSERT], 141000, 21144.76338028169
[INSERT], 142000, 18525.819306930694
[INSERT], 143000, 18003.986202759446
[INSERT], 144000, 17257.426352128885
[INSERT], 145000, 17800.386610373946
[INSERT], 146000, 19718.050682261208
[INSERT], 147000, 18054.457750759877
[INSERT], 148000, 18178.145607701565
[INSERT], 149000, 17981.967124925282
[INSERT], 150000, 17209.580700746697
[INSERT], 151000, 18299.646915088575
[INSERT], 152000, 21856.321167883212
[INSERT], 153000, 16743.17354910714
[INSERT], 154000, 15666.694111516415
[INSERT], 155000, 14275.589073634204
[INSERT], 156000, 14119.306199716044
[INSERT], 157000, 15663.814600840336
[INSERT], 158000, 15467.602272727272
[INSERT], 159000, 11796.268169452002
[INSERT], 160000, 13077.966652040368
[INSERT], 161000, 18742.921923797625
[INSERT], 162000, 17171.717640320734
[INSERT], 163000, 18606.742642454603
[INSERT], 164000, 15780.524926686217
[CLEANUP], Operations, 30
[CLEANUP], AverageLatency(us), 8.433333333333334
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 77
[CLEANUP], 0, 8.433333333333334
java -cp /root/ycsb/YCSB/hbase/src/main/conf:/root/ycsb/YCSB/hbase/target/hbase-binding-0.1.4.jar:/root/ycsb/YCSB/hbase/target/archive-tmp/hbase-binding-0.1.4.jar:/root/ycsb/YCSB/nosqldb/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf:/root/ycsb/YCSB/jdbc/src/main/conf/postgresql-9.3-1100.jdbc41.jar:/root/ycsb/YCSB/infinispan/src/main/conf:/root/ycsb/YCSB/dynamodb/conf:/root/ycsb/YCSB/core/target/core-0.1.4.jar:/root/ycsb/YCSB/gemfire/src/main/conf:/root/ycsb/YCSB/voldemort/src/main/conf com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.HBaseClient -P /root/ycsb/config/hbase.conf -P /root/ycsb/config/workload-ycsb-thomas -P /root/ycsb/config/workload-ycsb-thomas-load -s -load